app/controllers/register_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "test"], ["password_digest", "$2a$10$0leaoPHjmboCcHninBn2Yeb5h9aMbSTHoE8uNgevo5EHzHJ5rwNLS"], ["created_at", "2019-03-17 20:15:51.484147"], ["updated_at", "2019-03-17 20:15:51.484147"]]
---
    def createNewUser
        @user = User.new(user_params)
        puts @user
        if (@user.valid?)
            @user.save